[{
  "info": "",
  "title": "",
  "url": "https://pennapps-xvii.devpost.com/submissions?page=4"
},
{
  "info": "",
  "title": "Cya",
  "url": "https://devpost.com/software/cya"
},
{
  "info": "Cryptopedia aims to shorten the length of papers into several sentences or paragraphs. Whilst we could insert any input of long paragraphs, our main focus was on cryptocurrency. Therefore, we wanted to \"summarize\" the length of White Papers, a 20 pages long paper detailing how each currency works. Shorting the papers will ensure that people make their correct decisions whether to invest or not. Rose and I wanted to take this a step further and implement this function of the application to work with Amazon's Alexa. ",
  "title": "Cryptopedia with Alexa",
  "url": "https://devpost.com/software/crypto-for-alexa"
},
{
  "info": "",
  "title": "Hive Mind",
  "url": "https://devpost.com/software/hive-mind"
},
{
  "info": "keypacitance adds a whole new layer of touch input into your computer by way of capacitance touch sensing. By adding capacitive touch sensors to the individual keys on your keyboard, a new way of interacting with your computer can be realized. The potential applications and neat projects you can do with this are as numerous as developers are creative. That being said, our hack focuses on one specific application that we think is pretty cool, VR. ",
  "title": "keypacitance ",
  "url": "https://devpost.com/software/keypacitance"
},
{
  "info": "Seshat lets a user keep track of their own educational records while also guaranteeing validity for others who want to see accurate information. Instead of requiring a middleman like the CollegeBoard, students can send their info to interested parties (like colleges) directly by sending their Seshat address. Furthermore, trust is established on the network as only whitelisted authorities can make changes to a student's transcript or exam grades (authorities like schools, colleges, test administrators, etc). Furthermore, as a proof of concept, Seshat provides an example exam that can grade a student's answers and directly update their records, showing that even testing can be done in a decentralized fashion.",
  "title": "Seshat",
  "url": "https://devpost.com/software/seshat-t45nqj"
},
{
  "info": "Using AR technology, Wae FindAR helps you find the best route to your destination with Knuckles helping guide you through da wae at each turn. ",
  "title": "Wae FindAR",
  "url": "https://devpost.com/software/wae-findar"
},
{
  "info": "Entities can assign and manage privileges for resources they possess by publishing that a certain user (with an associated public key) has access to a resource on the ethereum blockchain (this can be temporary or perpetual). During authentication, entities validate that users hold the private keys to their associated public keys using challenge and response. A user needs only to keep his private key and remember his username. ",
  "title": "Keychain",
  "url": "https://devpost.com/software/keychain"
},
{
  "info": "Groupify allows Spotify users to become digital jukeboxes, which other users can control using an intuitive texting interface. When Groupify is enabled, other users can add their favorite songs to the playback queue, which will play automatically. When there isn't a song in the queue, a playlist specified by the host will play instead.",
  "title": "Groupify",
  "url": "https://devpost.com/software/groupify-ucdztr"
},
{
  "info": "We created a Chrome Extension to pair with your phone and use its gyroscope data to track the motion of the phone and display a \"laser point\" on the screen based on the data. The user can utilize natural motions to switch to presentation mode and move the laser pointer to the location of their desire. Also, to mimic most presentation laser pointers, we added a clicking feature (which is still buggy).  However, we felt that we could go further with the project to fully utilize the power of your web browser. So, we integrated a Q & A mode that outdoes the traditional laser pointer. The presenter displays the question, and the browser takes input from the phones of audience members. ",
  "title": " Bionic Lazer",
  "url": "https://devpost.com/software/bionic-lazer"
},
{
  "info": "ChowPal is able to scan restaurant menu's and give additional information in order to aid you in making tough decisions. ",
  "title": "ChowPal",
  "url": "https://devpost.com/software/chowpal-vj54bo"
},
{
  "info": "Uses arm gesture recognition technology, gyroscopic motion, acceleration and orientation to view and navigate STL files.",
  "title": "3D-Myosis",
  "url": "https://devpost.com/software/3d-myosis"
},
{
  "info": "Synaptic Gestures allows users to select the type of gesture they would like to perform, then select the action that would correspond with that gesture. After they apply their new configuration, they can perform the gesture to execute the action.Gestures include:\nTapping\nSwiping up\nSwiping down\nSwiping left\nSwiping right\nEach gesture can be performed with one, two, or three fingers. Actions include:\nCopy\nPaste\nSwitching between windows\nSwitching between virtual desktops\nGoing back in a browser\nMiddle clicking\nScrolling up/down/left/right\nMinimizing/maximizing windows\n",
  "title": "Synaptic Gestures",
  "url": "https://devpost.com/software/synaptic-gestures"
},
{
  "info": "Users can add the ingredients they have available and their quantities to the web app. Then they can filter based on ingredients and deviation (number of ingredients not in the Pantry that a recipe may have), tags, number of ingredients, difficulty level, time, active time, etc",
  "title": "Recipe Finder",
  "url": "https://devpost.com/software/recipe-finder-zed7q5"
},
{
  "info": "This is an AR game. The objective of the game is to shoot \"good vibes\" to angry retro penguins that will turn happy once they are hit with the \"good vibes\". The goal is to dodge the \"bad vibes\" that the angry penguins are sending constantly. While you are dodging \"bad vibes\" and sending \"good vibes\"you can also burn a descent amount of calories. Since the game is always sending \"bad vibes\", players are always moving and are active while engaging in a fun, augmented reality experience. ",
  "title": "Funky Fitness ",
  "url": "https://devpost.com/software/funky-fitness"
},
{
  "info": "A neural network predicts the position of objects to counter lag. We demonstrated this concept by creating a web game that communicated with the server every 0.75 seconds. At the click of a button, the 0.75-second interval is filled with the predicted movement, and the lag vanishes.",
  "title": "Lagacetamol",
  "url": "https://devpost.com/software/lagacetamol"
},
{
  "info": "Our project is able to identify who is speaking by using Microsoft Azure's Speech Identification API that uses AI and an audio file. The file is recorded as monolithic .wav file and it has a sampling rate of 16k @ 16 bit PCM. The audio file is then compared to a dataset created with audio files of the Alzheimer's patient's relatives. This way, the input audio file is able to be compared to the dataset by Microsoft Azure's Speaker Identification services which decides to which person the input audio file most similarly sounds like.",
  "title": ";Who is this?",
  "url": "https://devpost.com/software/blankk-name"
},
{
  "info": "",
  "title": "ARCHive",
  "url": "https://devpost.com/software/archive-9tm082"
},
{
  "info": "Quintessence provides a totally immersive experience of music through virtual reality. You can choose what parts of the music you want to hear/mute and see the effect of your choice; you can also learn about instruments simply by playing with it in combination with other instruments; you can give instructions to the musicians with voice control!",
  "title": "Quintessence",
  "url": "https://devpost.com/software/quintessence"
},
{
  "info": "Shakespearean poetry is hard to write. This tool will aid you in your endeavor to write rhythmic and interesting poetry.",
  "title": "PoetryAndMe",
  "url": "https://devpost.com/software/poetryandme"
},
{
  "info": "Crypto Collective aggregates tweets accessed through the Twitter API. It then processes these tweets using Microsoft Azure's text analytics service which returns numerical user sentiment data. This data was then formatted into a user friendly interface and displayed on our website. This will undoubtedly aid users in their cryptocurrency investments.",
  "title": "Crypto Collective",
  "url": "https://devpost.com/software/crypto-collective"
},
{
  "info": "The Page Turner is an actual page turner! When you flip the page, the Page Turner uses an ultrasonic sensor to detect the page turn and consequently \"turns\" the page on your e-reader. The servo then flips your page back into place so that you can endlessly flip the page to control your e-reader. ",
  "title": "The Page Turner",
  "url": "https://devpost.com/software/hackathon-5f6q2n"
},
{
  "info": "When an 'abuser' enters within a set radius of a 'victim', the abuser gets an alert telling them they have entered within the vicinity and need to leave. While the victim gets an alert telling them that the abuser has come within the vicinity as well, they also get the option of calling emergency services, with their location sent over in real time so the operator will have their location, as well as the other person's location, in real time.",
  "title": "Restrain Alert",
  "url": "https://devpost.com/software/restrain-alert"
},
{
  "info": "On Tune-Chainz, you can upload your musical creations without the need for a music label. Powered by Ethereum, a smart-contract is generated upon each song's upload, allowing users to buy, sell, and listen to music with one another without a third party. Users can also listen to music that they have bought/produced on their profile page.",
  "title": "Tune-Chainz",
  "url": "https://devpost.com/software/tune-chainz"
},
{
  "info": "The website has multiple facets that can help consumers learn more about the growing cryptospace. It summarizes overly complex whitepapers from coins to a few sentences using NLP. It also selects the key words and shows them. Secondly, it has a variety of curated articles that explain, discuss, and hypothesize the future of cryptocurrencies in the resources section.",
  "title": "Cryptopedia",
  "url": "https://devpost.com/software/cryptopedia"
}]